let input = document.getElementById("myInput");
let output = document.getElementById("output");
let button = document.getElementById("button");
let page = document.getElementById("page");
let normal = ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z","A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z","0","1","2","3","4","5","6","7","8","9"];
let blue = ["🇦‌","🇧‌","🇨‌","🇩‌","🇪‌","🇫‌","🇬‌","🇭‌","🇮‌","🇯‌","🇰‌","🇱‌","🇲‌","🇳‌","🇴‌","🇵‌","🇶‌","🇷‌","🇸‌","🇹‌","🇺‌","🇻‌","🇼‌","🇽‌","🇾‌","🇿‌","🇦‌","🇧‌","🇨‌","🇩‌","🇪‌","🇫‌","🇬‌","🇭‌","🇮‌","🇯‌","🇰‌","🇱‌","🇲‌","🇳‌","🇴‌","🇵‌","🇶‌","🇷‌","🇸‌","🇹‌","🇺‌","🇻‌","🇼‌","🇽‌","🇾‌","🇿‌","0️⃣","1️⃣","2️⃣","3️⃣","4️⃣","5️⃣","6️⃣","7️⃣","8️⃣","9️⃣"];
let sansSerifBold = ["𝐚","𝐛","𝐜","𝐝","𝐞","𝐟","𝐠","𝐡","𝐢","𝐣","𝐤","𝐥","𝐦","𝐧","𝐨","𝐩","𝐪","𝐫","𝐬","𝐭","𝐮","𝐯","𝐰","𝐱","𝐲","𝐳","𝐀","𝐁","𝐂","𝐃","𝐄","𝐅","𝐆","𝐇","𝐈","𝐉","𝐊","𝐋","𝐌","𝐍","𝐎","𝐏","𝐐","𝐑","𝐒","𝐓","𝐔","𝐕","𝐖","𝐗","𝐘","𝐙","𝟎", "𝟏", "𝟐", "𝟑", "𝟒", "𝟓", "𝟔", "𝟕", "𝟖", "𝟗"];
let fullWidth = ["ａ","ｂ","ｃ","ｄ","ｅ","ｆ","ｇ","ｈ","ｉ","ｊ","ｋ","ｌ","ｍ","ｎ","ｏ","ｐ","ｑ","ｒ","ｓ","ｔ","ｕ","ｖ","ｗ","ｘ","ｙ","ｚ","Ａ","Ｂ","Ｃ","Ｄ","Ｅ","Ｆ","Ｇ","Ｈ","Ｉ","Ｊ","Ｋ","Ｌ","Ｍ","Ｎ","Ｏ","Ｐ","Ｑ","Ｒ","Ｓ","Ｔ","Ｕ","Ｖ","Ｗ","Ｘ","Ｙ","Ｚ","０","１","２","３","４","５","６","７","８","９"];
let circled1 = ["🅐","🅑","🅒","🅓","🅔","🅕","🅖","🅗","🅘","🅙","🅚","🅛","🅜","🅝","🅞","🅟","q","🅡","🅢","🅣","🅤","🅥","🅦","🅧","🅨","🅩","🅐","🅑","🅒","🅓","🅔","🅕","🅖","🅗","🅘","🅙","🅚","🅛","🅜","🅝","🅞","🅟","q","🅡","🅢","🅣","🅤","🅥","🅦","🅧","🅨","🅩","✪","❶","❷","❸","❹","❺","❻","❼","❽","❾","❿"]; 
let circled2 = ["ⓐ","ⓑ","ⓒ","ⓓ","ⓔ","ⓕ","ⓖ","ⓗ","ⓘ","ⓙ","ⓚ","ⓛ","ⓜ","ⓝ","ⓞ","ⓟ","ⓠ","ⓡ","ⓢ","ⓣ","ⓤ","ⓥ","ⓦ","ⓧ","ⓨ","ⓩ","Ⓐ","Ⓑ","Ⓒ","Ⓓ","Ⓔ","Ⓕ","Ⓖ","Ⓗ","Ⓘ","Ⓙ","Ⓚ","Ⓛ","Ⓜ","Ⓝ","Ⓞ","Ⓟ","Ⓠ","Ⓡ","Ⓢ","Ⓣ","Ⓤ","Ⓥ","Ⓦ","Ⓧ","Ⓨ","Ⓩ","⓪","0","1","2","3","4","5","6","7","8","9"];
let squared = ["🄰","🄱","🄲","🄳","🄴","🄵","🄶","🄷","🄸","🄹","🄺","🄻","🄼","🄽","🄾","🄿","🅀","🅁","🅂","🅃","🅄","🅅","🅆","🅇","🅈","🅉","🄰","🄱","🄲","🄳","🄴","🄵","🄶","🄷","🄸","🄹","🄺","🄻","🄼","🄽","🄾","🄿","🅀","🅁","🅂","🅃","🅄","🅅","🅆","🅇","🅈","🅉","0","1","2","3","4","5","6","7","8","9"];
let fraktur = ["𝔞","𝔟","𝔠","𝔡","𝔢","𝔣","𝔤","𝔥","𝔦","𝔧","𝔨","𝔩","𝔪","𝔫","𝔬","𝔭","𝔮","𝔯","𝔰","𝔱","𝔲","𝔳","𝔴","𝔵","𝔶","𝔷","𝔄","𝔅","ℭ","𝔇","𝔈","𝔉","𝔊","ℌ","ℑ","𝔍","𝔎","𝔏","𝔐","𝔑","𝔒","𝔓","𝔔","ℜ","𝔖","𝔗","𝔘","𝔙","𝔚","𝔛","𝔜","ℨ","0","1","2","3","4","5","6","7","8","9"];
let frakturbold = ["𝖆","𝖇","𝖈","𝖉","𝖊","𝖋","𝖌","𝖍","𝖎","𝖏","𝖐","𝖑","𝖒","𝖓","𝖔","𝖕","𝖖","𝖗","𝖘","𝖙","𝖚","𝖛","𝖜","𝖝","𝖞","𝖟","𝕬","𝕭","𝕮","𝕯","𝕰","𝕱","𝕲","𝕳","𝕴","𝕵","𝕶","𝕷","𝕸","𝕹","𝕺","𝕻","𝕼","𝕽","𝕾","𝕿","𝖀","𝖁","𝖂","𝖃","𝖄","𝖅","0","1","2","3","4","5","6","7","8","9"]; 
let doubleStruck = ["𝕒","𝕓","𝕔","𝕕","𝕖","𝕗","𝕘","𝕙","𝕚","𝕛","𝕜","𝕝","𝕞","𝕟","𝕠","𝕡","𝕢","𝕣","𝕤","𝕥","𝕦","𝕧","𝕨","𝕩","𝕪","𝕫","𝔸","𝔹","ℂ","𝔻","𝔼","𝔽","𝔾","ℍ","𝕀","𝕁","𝕂","𝕃","𝕄","ℕ","𝕆","ℙ","ℚ","ℝ","𝕊","𝕋","𝕌","𝕍","𝕎","𝕏","𝕐","ℤ","𝟘","𝟙","𝟚","𝟛","𝟜","𝟝","𝟞","𝟟","𝟠","𝟡"];
let boldItalic = ["𝒂","𝒃","𝒄","𝒅","𝒆","𝒇","𝒈","𝒉","𝒊","𝒋","𝒌","𝒍","𝒎","𝒏","𝒐","𝒑","𝒒","𝒓","𝒔","𝒕","𝒖","𝒗","𝒘","𝒙","𝒚","𝒛","𝑨","𝑩","𝑪","𝑫","𝑬","𝑭","𝑮","𝑯","𝑰","𝑱","𝑲","𝑳","𝑴","𝑵","𝑶","𝑷","𝑸","𝑹","𝑺","𝑻","𝑼","𝑽","𝑾","𝑿","𝒀","𝒁","0","1","2","3","4","5","6","7","8","9"];
let monospace = ["𝚊","𝚋","𝚌","𝚍","𝚎","𝚏","𝚐","𝚑","𝚒","𝚓","𝚔","𝚕","𝚖","𝚗","𝚘","𝚙","𝚚","𝚛","𝚜","𝚝","𝚞","𝚟","𝚠","𝚡","𝚢","𝚣","𝙰","𝙱","𝙲","𝙳","𝙴","𝙵","𝙶","𝙷","𝙸","𝙹","𝙺","𝙻","𝙼","𝙽","𝙾","𝙿","𝚀","𝚁","𝚂","𝚃","𝚄","𝚅","𝚆","𝚇","𝚈","𝚉","0","1","2","3","4","5","6","7","8","9"];
let zagloo = ["a̵̧̡̛̮̦̫̕͜","b̴̞̗́̀̄́̊͝","c̴̢̪̰͚̝͈̦̫̽̔͛̀̾̅͜͜","d̴̛̤̖̝̮̐͌͛͆̄͌̒","ȩ̶̝̳̮̙̞̐̆̃͒̐͘͝","f̵̨̢̛̘̤̖̠̪̤̜͊̑̉̇͘͠","g̸̪̯͒́̇̔̽́͘","h̵̛̛̛̝̩̐̆̓͌͜","i̸̡̼̠̯͑͌̈́́","j̴̹͎͍̺̫̜̈̂͘͠͝","k̴̝̫̆͒̓","l̶̢̳͔͉̩̘͖͘͝͝","m̶̧̱̠̤̘̥͕͘͜","n̴̢̰̭̘̣̪̈͠ͅ","ó̵̼̝͉̼̱̜̬̾̋͗̂̕͜͝","p̸̥̒͒̓̀͌̐̆̏̐̕","q̴̡͎̩̮̪͍̙̩͙̣͊̌͐̏","r̸̺̻̣̰̦̭͗","s̴͚̈͌͌͊̈́̚̚","t̴̛̼̻̜̖͙̐̓̽̅̉̕ͅ","u","̵̫͈̓̀̏͘v̵̙̖̞̮̦̹̭͇͂͌̓̌","ŵ̴̥͑̉̀̇̓͊́͜","x̵͓̣̝̣͕̖̭̅́̀͝͠","ỹ̶̬̩͚̱̈́͆̑̄̕","z̵̭̖͙̲̼̤̳̐ͅ","Ă̵͙̒͌͑͒͊͌͠͠","B̴̡͉̼͎͉͔̈̒̑̿͜","C̴̙̀̆̈͐͛͠","D̷̨̨̨̥̙̈́͆͒͠","E̷̡̛̓͑̎͌̿̾͝","F̷̻̋̋̋͒͜","G̴̭̖͉͙͍͎̈͛̋́̈́͐̀̿̚͝ͅ","Ḩ̷̬̱͙̟̜͕̀̽̒̄͗̚","Ì̷̡̧̫̪̤̎̈́̓̈́̀̓͠͠","J̸͚̹̠̏̓̀̃","K̴͔̠̪̩̫̖̠̐","L̶̢̰̥̙̠̺̖̳͔͇̒̈͒̒͛̒͑̌̚","M̵̨̛͈̫̼͎̽͆̈̀̔̓","Ṅ̵̡͎","O̵̧̢̙͈͂̑̂̃̈́","P̴̡̩̩̭͛͋̾́͠͝","Q̴̨̪̯̬̟̎̅̐̽́͘̕","R̷̳͕͖̯̲͖̀̽̇̄͘","S̴̙͈͚̬͋͒͂̽̀͒̈̈̅̃","T̴͎̈́͌̑͊̒̉̀","Ǔ̵̢͎̺̙̫͎͊̓̈́̓̚͝","V̷̯̺̒͊̚","W̶̢̢͉̯͓̻̦̩̏̐̆̎̉̔͛̔̾","X̴̛͉̯͍͔̬͖̅̃̾̀̿̂͆̈́͜","Y̷̡͇̹̋͌́̓̔͝͝","Ẓ̶̡̱̭̻͈̯̣͎̀̀̈","0̶̣̄","1̵̨̪͎̫̓̇","2̶̢̙̇̒͗́͂̎̋̚͠","3̸͚̜̮̪̝͍͙̞̲̱̆4̶̨̧̺̦̤̭͈̗̭̉͑͋̀̑̈́͂","5̷̖̖̖̹̗̭̞͚̇͛͊͐̊͆̏͋̿̊","6̴̮́͒̃̈͌̆̍̌̊͜","7̸̡̭̺͚̰̌͘","8̷̳̥̲͕͗","9̷̝̹̀̃͋̍̋̏̔"]
let beautiful = ["𝓪","𝓫","𝓬","𝓭","𝓮","𝓯","𝓰","𝓱","𝓲","𝓳","𝓴","𝓵","𝓶","𝓷","𝓸","𝓹","𝓺","𝓻","𝓼","𝓽","𝓾","𝓿","𝔀","𝔁","𝔂","𝔃","𝓐","𝓑","𝓒","𝓓","𝓔","𝓕","𝓖","𝓗","𝓘","𝓙","𝓚","𝓛","𝓜","𝓝","𝓞","𝓟","𝓠","𝓡","𝓢","𝓣","𝓤","𝓥","𝓦","𝓧","𝓨","𝓩","0","1","2","3","4","5","6","7","8","9"];
let random = ["ค","𝐁","ℂ","𝓭","ᵉ","ⓕ","𝐆","ᕼ","Ꭵ","Ĵ","𝔨","ˡ","𝕄","𝓃","𝔬","Ƥ","q","𝐫","ˢ","𝓉","υ","Ѷ","𝐖","א","𝓨","𝔷","ⓐ","๒","匚","𝐝","𝐄","𝒇","ᵍ","н","Ｉ","ʲ","𝓚","Ｌ","Ｍ","ℕ","𝕠","𝐩","𝔮","я","ş","Ť","Ǘ","𝔳","山","𝔁","Ƴ","Ⓩ","ʘ","➀","❷","➂","❹","➄","❻","❼","❽","❾"];
let tiny = ["ᴀ","ʙ","ᴄ","ᴅ","ᴇ","ꜰ","ɢ","ʜ","ɪ","ᴊ","ᴋ","ʟ","ᴍ","ɴ","ᴏ","ᴘ","Q","ʀ","ꜱ","ᴛ","ᴜ","ᴠ","ᴡ","x","ʏ","ᴢ","ᴀ","ʙ","ᴄ","ᴅ","ᴇ","ꜰ","ɢ","ʜ","ɪ","ᴊ","ᴋ","ʟ","ᴍ","ɴ","ᴏ","ᴘ","Q","ʀ","ꜱ","ᴛ","ᴜ","ᴠ","ᴡ","x","ʏ","ᴢ","0","1","2","3","4","5","6","7","8","9"];
let fancy = ["ꪖ","᥇","ᥴ","ᦔ","ꫀ","ᠻ","ᧁ","ꫝ","꠸","꠹","ᛕ","ꪶ","ꪑ","ꪀ","ꪮ","ρ","ꪇ","᥅","ᦓ","ꪻ","ꪊ","ꪜ","᭙","᥊","ꪗ","ƺ","ꪖ","᥇","ᥴ","ᦔ","ꫀ","ᠻ","ᧁ","ꫝ","꠸","꠹","ᛕ","ꪶ","ꪑ","ꪀ","ꪮ","ρ","ꪇ","᥅","ᦓ","ꪻ","ꪊ","ꪜ","᭙","᥊","ꪗ","ƺ","ᦲ","᧒","ᒿ","ᗱ","ᔰ","Ƽ","ᦆ","ᒣ","Ზ","ၦ"];
let tiny2 = ["ₐ","b","c","d","ₑ","f","g","ₕ","ᵢ","ⱼ","ₖ","ₗ","ₘ","ₙ","ₒ","ₚ","q","ᵣ","ₛ","ₜ","ᵤ","ᵥ","w","ₓ","y","z","ₐ","B","C","D","ₑ","F","G","ₕ","ᵢ","ⱼ","ₖ","ₗ","ₘ","ₙ","ₒ","ₚ","Q","ᵣ","ₛ","ₜ","ᵤ","ᵥ","W","ₓ","Y","Z","₀","₁","₂","₃","₄","₅","₆","₇","₈","₉"];




let fonts = [
  { name: "𝐒𝐚𝐧𝐬𝐒𝐞𝐫𝐢𝐟 𝐁𝐨𝐥𝐝", array: sansSerifBold },
  { name: "Ｆｕｌｌ Ｗｉｄｔｈ", array: fullWidth },
  { name: "🅂🅀🅄🄰🅁🄴🄳", array: squared },
  { name: "𝔉𝔯𝔞𝔨𝔱𝔲𝔢", array: fraktur },
  { name: "𝔻𝕠𝕦𝕓𝕝𝕖", array: doubleStruck },
  { name: "𝑰𝒕𝒂𝒍𝒊𝒄 𝑩𝒐𝒍𝒅", array: boldItalic },
  { name: " 𝙼𝚘𝚗𝚘 𝚜𝚙𝚊𝚌𝚎", array: monospace },
  { name: "🅒🅘🅡🅒🅛🅔🅢 ❶", array: circled1 },
  { name: "Ⓒⓘⓡⓒⓛⓔⓢ ²", array: circled2},
  { name: "🇧‌🇱‌🇺‌🇪‌", array: blue },
  { name: "z̵̭̖͙̲̼̤̳̐ͅa̵̧̡̛̮̦̫̕͜g̸̪̯͒́̇̔̽́͘l̶̢̳͔͉̩̘͖͘͝͝ó̵̼̝͉̼̱̜̬̾̋͗̂̕͜͝ó̵̼̝͉̼̱̜̬̾̋͗̂̕͜͝", array: zagloo },
  { name: "𝓑𝓮𝓪𝓾𝓽𝓲𝓯𝓾𝓵 ", array: beautiful },
  { name: "ᠻꪖꪀᥴꪗ", array: fancy},
  { name: "ᴛɪɴʏ ʟᴇᴛᴛᴇʀꜱ1", array: tiny },
  { name: "ₜᵢₙy ₗₑₜₜₑᵣₛ₂", array: tiny2},
  { name: "яค𝓃𝓭𝔬𝕄", array: random },
];
for (let x = 0; x < fonts.length; x++) {
  let fontbtn = document.createElement("button");
  fontbtn.innerText = fonts[x].name;
  fontbtn.classList.add("button");
  page.appendChild(fontbtn);

  fontbtn.addEventListener("click", function () {
    start(fonts[x].array); 
    output.innerText += "";
  });
}



function start(font){
input.addEventListener("input", function () {
  let text = input.value;
  let result = "";

  t()
  function t(){
    for (let i = 0; i < text.length; i++) {
      let char = text[i]; //تبدی   برای )
      let index = normal.indexOf(char);
      if (index !== -1) {
        result += font[index];
      } else {
        result += char;
      }
    }
  }

  output.innerText = result;
  button.addEventListener("click",function(){
    navigator.clipboard.writeText(result);
  });
});
}
