let unicodes = "⚝★✦✧✩✪✫✬✭✮✯✰✵✺✹✶✻❉✿✾❃❁❈❆❋❅✲❊❖✳❏❍❑❐❒❢❣❥❦❧❡❝❞❛❜❨❩❪❫❬❭❮❯❰❱❲❳❴❵✒✎✏✐✁✂✃✕✖✗✘✓✔✙✚✛✝✞✟✠✡⚰♱♰♮♯⚞⚟⚠✉⚬⚊⚋⚌⚍⚎⚏⚆⚇⚈⚉⚀⚁⚂⚃⚄⚅♼♻♽♾♩♪♫♬♭♔♚♕♛♖♜♗♝♘♞♙♟♡♢♤♧☹☻☽☾☯☮☭☬☫☪☩☨☣☢☡☟☞☜☛☚☙☘☗☓☒☑☐☏⌫⌦⌘➔➘➙➚➛➜➞➟➠➡➢➣➤➥➦➧➨➩➫➭➮➪➯➱➲➳➴➵➶➸➹➺➻➼➽➾🃞🃜🃟🃑🃊🂲🂱‽𓐑𓏴𓏆𓏄𓊆𓊇𓊈𓊉𓊅𓊊𓊍𓊎𓉨𓉧𓉡𓈺𓈦𓈖𓈗𓈛𓈜𓇽𓇠𓇙𓇚𓇑𓇒𓆸𓆡𓆢𓆣𓆛𓆜𓆝𓆞𓆟𓆤𓆦𓆨𓆧𓆗𓆐𓆕𓆓𓆏𓆉𓆈𓆊𓆆𓅽𓅾𓆃𓅼𓆂𓅷𓅺𓅻𓅳𓅮𓅯𓅬𓅪𓅨𓅥𓅢𓅞𓅚𓅛𓅘𓅐𓅌𓅇𓅂𓄿𓅀𓅅𓄯𓄚𓄂𓄁𓃸𓃷𓃹𓃶𓃯𓃦𓃱𓃰𓃟𓃥𓃜𓃘𓃔𓃖𓂭𓂮𓂯𓂰𓂶𓂉𓂎𓂏𓁺𓂀↺↻↶↷⇑⇓⇒⇔⇖⇚⇛⇄⇆↩↪↜↝↔↕⟲⟳⟰⟱⟸⟹⟽⟾⟿⤅⤋⤊⤇⤣⤤⤧⤩⤪⤯⤰⤸⤹⤳⤾⤿⤺⤴⤵⤼⤽⥅⥆⥃⥄⥩⥨؆؇؈؋،؍؎؏ؘؙؚؐؑؒؓؔؕؖؗؠءآأؤإئىابةتثجحخدذرزسصضطظعغػؼؽؾؿـفقكلمنهوىيًٌٍَُِّْٕٖٜٟٓٔٗ٘ٙٚٛٝٞ٠١٢٣٤٥٦٧٨٩٪٫٬٭ٮٯٰٱٲٳٴٵٶٷٸٹٺٻټٽپٿڀځڂڃڃڅچڇډډڊڋڌڍڎڏڐڑڒړڔڕږڗژڙښڛڜڝڞڟڠڡڢڣڤڥڦڧڨکڪګڬڭڮگڰڱڲڳڴڵڶڷڸڹںڻڼڽھڿۀہۂۃۄۅۆۇۈۉۊۋیۍێۏېۑےۓ۔ەۖۗۘۙۚۛۜ۞ۣ۟۠ۡۢۤۥۦۧۨ۩۪ۭ۫۬ۮۯ۰۱۲۳۴۵۶۷۸۹ۺۻۼ۽۾ۿ܀܁܂܃܄܅܆܇܈܉܊܋܌܍ܐܑܒܓܔܕܖܗܘܙܚܛܜܝܞܟܠܡܢܣܤܥܦܧܨܩܪܫܬܭܮܯܱܴܷܸܹܻܼܾ݂݄݆݈ܰܲܳܵܶܺܽܿ݀݁݃݅݇݉݊ݍݎݏݐݑݒݓݔݕݖݗݘݙݚݛݜݝݞݟݠݡݢݣݤݥݦݧݨݩݪݫݬݭݮݯݰݱݲݳݴݵݶݷݸݹݺݻݼݽݾݿi꧁꧂࿐ ᭄␥၍⎙┶┷┸┹┺┻┼┽┾┿╀╁╂╃╄╅╆╇╈╉╊╋┘┌╌╍╎╏═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬╭╮╯╰╱╲╳╵╶╸╹╺╻╼╽╾╿▀▁▂▃▄▅▆▇█▉▊▋▌▍◢◣◤◥▐▔⟁◭◮ᐕ▽▼◀◁⫷⫸◻︎◼︎□▢☐❏❐❑❒▣☒⊠⛋⚀▤▥▦▧▨▩░▒▓🜹❖◆⟡︎◇◈⟐⌑◊⟠⬧⧫【◊】◧◨◩◪◫◰◱◲◳▬▭▮▯▰▱⬟☗⬢⬣⏣𒊹֍֎𖣐◔◕⦿❍○⚬⚬◌𓐍◠◡𖠯𖠥𖠦𖠨𖢭𖣰𖦘𖥚𖥓༗𖥑𖥎𖥂𖤞𖤒𖤓𖤈𖤌𖤇𖢰𖢗𖢘𖢐𖢑𖢋𖢌𖢏𖡦𖦠𖢿𖢾𖢼𖢺𖣀𖣔𖣩𖣨𖣦𖣫𖣬𖣴𖣳𖣲⌬⌭⌮⌯⌰⌱⌲֍֎𖡝ꭗ𖡞𖢍𖢢𖢫𖠧𖠇𖢭𖢴𖢲𖢷𖣀𖢻▀▇  ꦿ ꦊ ꦎ ▂ ꧅ ▃▄▅█▇▆░▐▔ ◄► ▹◃ ▸◂ ◍ ﹅ ＼ ／ ඞ ◢◣◤◥⎆◐◑◈▼▬▭▮▯▩▨▥▟▙■□▣▛▜▒▓❪❫❰❱❮❯❪❫❬❭❨❩❬❭≪≫≼≽⊰⊱❴❵⟮⟯⦅⦆「」『』【】〖〗❲❳⎛⎠〈〉⟦⟧╁╀༿༾༼༽᭨ᭆᭅᬆᬉ፨࿑࿌࿈༅༙ྂ‌༅༙ྂ༉༈༄༁༇≝≎≝≌≣≬ཽ⬮⫻ꕇ 𖣥𖣺𖤖𖣅𖣄𖢿ᘜᘝ𖣀𖢯𖢛𖢮𖢐𖡼𖡭𖡐𖠷𖠶𖠳உ௸᳇⁂⁜𖠎⇟⇞⇶⇲⇱⇨⇦࿉࿃ၜ၌ၛ߷ഇൺ၄၃፨፴ᐸᐷᔢᔦᔨᔪᔺᕙᕘᖰᖳᖲᖱᖶᖵ§⎙";

let page = document.getElementById("page");

let flowrow = document.getElementById("flowrow")

for (const char of unicodes) {
  const span = document.createElement("div");
  span.className = "char-box";
  span.textContent = char;
  span.classList.add("unicode");
  span.addEventListener("click", function(){
    navigator.clipboard.writeText(span.innerText);
    });
  flowrow.appendChild(span);
}





